9/data/attachments/219cb2f2e85c41a2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_8f9509b4-4cfb-43f9-9e9d-1a7601f3ac5e</nif:username>
            <nif:friendToBeAdded>Jessica_whom_Friend_47088_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>